In [2]:
import pandas

In [3]:
df=pandas.read_csv("emp.csv")

In [4]:
df

      Name  Roollno  Salary
0   jyothi      111   40000
1    priya      112   35000
2     siri      113   45000
3    laxmi      114   50000
4   pragya      115   43000
5    bilal      116   50000
6    jaggu      117   63000
7  shivani      118   25000
8   suresh      119   65000
9      sst      120   70000

In [5]:
df["Salary"].max()

70000

In [12]:
df["Salary"].min()

25000

In [13]:
df["Salary"].mean()

48600.0

In [14]:
df["Salary"].head()

0    40000
1    35000
2    45000
3    50000
4    43000
Name: Salary, dtype: int64

In [7]:
df.describe()

         Roollno        Salary
count   10.00000     10.000000
mean   115.50000  48600.000000
std      3.02765  14135.848833
min    111.00000  25000.000000
25%    113.25000  40750.000000
50%    115.50000  47500.000000
75%    117.75000  59750.000000
max    120.00000  70000.000000

In [16]:
df.shape

(10, 3)

In [17]:
df["Name"]

0     jyothi
1      priya
2       siri
3      laxmi
4     pragya
5      bilal
6      jaggu
7    shivani
8     suresh
9        sst
Name: Name, dtype: object

In [6]:
df[["Name","Salary"]]

      Name  Salary
0   jyothi   40000
1    priya   35000
2     siri   45000
3    laxmi   50000
4   pragya   43000
5    bilal   50000
6    jaggu   63000
7  shivani   25000
8   suresh   65000
9      sst   70000

In [8]:
df[df.Salary==df['Salary'].max()]

  Name  Roollno  Salary
9  sst      120   70000

In [9]:
df.loc[5]

Name       bilal
Roollno      116
Salary     50000
Name: 5, dtype: object